---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.TopOfPartElevation
source: html/3e6f6504-c88c-f977-f914-08d8c423a5b5.htm
---
# Autodesk.Revit.DB.FabricationPart.TopOfPartElevation Property

The associated elevation to the top of fabrication part off of the current level.

## Syntax (C#)
```csharp
public double TopOfPartElevation { get; }
```